{
    "message": {
        "nav": {
            "intro": "intro",
            "about": "sobre",
            "skills": "skills",
            "portfolio": "portafolio",
            "education": "educación",
            "touch": "Estemos en Contacto"
        },
        "home": {
            "msg": "<h2>Hola!, Yo soy&nbsp;<span class='text-regular'>Miguel Alonso Marroquin</span>&nbsp;un apasionado desarrollador Front End, Diseño de interfaces y UX, viviendo actualmente en Perú. Bienvenido a mi portafolio! :)</h2>",
            "btn": "Portafolio"
        },
        "about": {
            "msg": "<h2 class='text-regular'>Soy un apasionado por la tecnología, me encantan los retos porque es la manera en la que me siento motivo a mejorar, tengo experiencia en tecnologías como <a href='https://www.w3.org/html/' target='_blank'>HTML</a>, <a href='https://www.w3.org/Style/CSS/Overview.en.html' target='_blank'>CSS</a>, <a href='https://developer.mozilla.org/en-US/docs/Web/JavaScript' target='_blank'>Javascript</a>, <a href='https://vuejs.org/' target='_blank'>VueJS</a> entre otros más. Me tomé el tiempo de aprender programación y web development y decidí que este es el tipo de trabajo que quiero ejercer, intentando mejorar siempre, algunas veces con errores pero aprendiendo constantemente. Me considero una persona comprometida con mi trabajo, dispuesto a contribuir y  aprender.</h2>"
        },
        "skills": {
            "sub": "Habilidades Blandas",
            "ul": {
              "li1": "Mobile First, Responsive Design.",
              "li2": "Browser Developer Tools.",
              "li3": "Empatía.",
              "li4": "Buena Comunicación.",
              "li5": "Con mucha voluntad de aprender.",
              "li6": "Flexible y Adaptable.",
              "li7": "Trabajo bajo presión."
            },
            "btn": "Herramientas",
            "sub2": "lenguajes de programación, frameworks y herramientas de desarrollo"
        },
        "portfolio": {
            "sub": "Trabajos que hice",
            "btn": "Proyectos",
            "details": "Ver Detalles",
            "view": "Ver Proyecto",
            "viewSite": "Ver el sitio",
            "tools": "Herramientas",
            "technologies": "Tecnologías",
            "viewGithub" : "Ver en Github",
            "projects": {
                "hadas": {
                    "description": "Empresa dedicada al servicio de limpieza. Estuve a cargo del desarrollo frontend de la página, anto de la versión pública como también la del panel de control administrativo (dashboard)."
                },
                "fixbrand": {
                    "description": "Un sitio web manejable con animaciones entre páginas. Mi trabajo consistía en diseñar y realizar 3 tipos diferentes de CRUD (cartera, clientes, contactos) en el front-end."
                },
                "glorieta": {
                    "description": "Un sitio web que permite a sus clientes realizar reservas online, además de mostrar información sobre el mismo, sus novedades e información de contacto. En este proyecto apliqué algunos conocimientos como OOP, manipulación DOM, Implementar cálculos y actualizaciones DOM complejos."
                },
                "social": {
                    "description": "Una SPA (proyecto personal) con caracteristicas de una red social, creado con Vue, Vuex, Firebase, Express. Este proyecto cubre cosas como integración/consumo de una REST Api server construido con Node js y express, registro, login y autenticación, upload de imagenes, notificaciones y más"
                },
                "portfolio": {
                    "description": "Después de practicar con Vue haciendo algunas plantillas creando paginas web o SPA, decidí que era momento de crear un nuevo portafolio para demostrar todos mis trabajos, para ello me puse manos a la obra, empecé creando un nuevo proyecto con vue-cli, para los estilos use Sass junto a la metodología BEM, cada componente y view de cada pagina tiene su archivo .scss y todo está importado en el main.scss, me pareció una manera más ordeanada de trabajar. Empecé con mobile first design, luego tablet y desktop. Las animaciones están hechas con puro css y otras con pequeñas librerías. Las rutas y las imagenes están contruidas bajo el concepto de Lazy Loading que mejora el performance de la página."
                }
            }
        },
        "education": {
            "sub": "Cursos que Hice",
            "certificates": "Certificados"
        }
    }
}